---
kind: type
id: T:Autodesk.Revit.DB.Macros.ModuleSettings
source: html/2a0c5aed-a80e-6c91-0525-ad8d42d613a6.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings

The module settings.

## Syntax (C#)
```csharp
public class ModuleSettings : IDisposable
```